validation/hyqmom/jetCrossing2D/0.org/weight.12
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      weight.12;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    walls
    {
        type               zeroGradient;
    }
    outlet
    {
        type               zeroGradient;
    }
    inlet1
    {
        type               fixedValue;
        value              uniform 0;
    }
    inlet2
    {
        type               fixedValue;
        value              uniform 0;
    }
    defaultFaces
    {
        type    empty;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
